{
    "findRoommate": "Find a roommate",
    "coverHeader": "Find a roommate and split the rent",
    "findRoommateText": "Explore available rooms and potential roommates based on your criteria.",
    "roommateMatching": "Matching",
    "roommateMatchingText": "Reach out to potential roommates and landlords to discuss further details.",
    "findAffordable": "Find an affordable apartment",
    "room": "Room",
    "inMonth": "In month",
    "area": "Area M2",
    "viewAll": "View all",
    "support": "24/7 Support",
    "supportText": "24/7 support available for all your needs.",
    "rate": "We've assisted 5000 users in finding roommates, prioritizing your safety.",
    "partnersHead1": "Discover a roommate",
    "partnersText1": "Discover a roommate, an affordable home, and share the rent",
    "partnersHead2": "For landlords",
    "partnersText2": "Rent out your home with 2 months' rent insurance and prevent property damage.",
    "startSearch": "Start your search now",
    "leaveFlat": "Leave us the apartment",
    "contactUs": "Contact us",
    "contactUsText": "Contact us if you have any questions",
    "reviewsHead": "Customer reviews",
    "reviewName1": "Tamari",
    "reviewText1": "Roommate.ge made finding affordable housing stress-free. Their negotiation with landlords saved me time and money!",
    "reviewName2": "Eka",
    "reviewText2": "Thanks to Roommate.ge, I found a great roommate and a budget-friendly home. Highly recommend it!",
    "reviewName3": "Lasha",
    "reviewText3": "Roommate.ge's platform is user-friendly and their team is incredibly helpful. They made finding affordable housing a breeze!",
    "reviewName4": "Isabell",
    "reviewText4": "Grateful to Roommate.ge for simplifying my housing search. Found a perfect roommate and place without breaking the bank!",
    "questionsHead": "Frequently Asked Questions",
    "question1": " How does Roommate.ge work?",
    "answer1": "Roommate.ge is a platform designed to help individuals find compatible roommates and affordable housing options. Users can create profiles, search for available rooms or roommates based on their preferences, and connect with potential matches. ",
    "question2": "Is Roommate.ge only for finding roommates, or can I also search for housing options?",
    "answer2": "Roommate.ge offers both options. You can search for potential roommates to share a space with, or you can browse through listings of available rooms or apartments to find housing options that suit your needs and budget",
    "question3": "How do I create a profile on Roommate.ge?",
    "answer3": "Creating a profile on Roommate.ge is easy! Simply sign up with your phone number and email address, fill out your profile with information about yourself, your preferences, and what you're looking for in a roommate or housing situation. ",
    "question4": "Is there a fee to use Roommate.ge?",
    "answer4": "Roommate.ge offers both free and premium membership options. While basic features like creating a profile and browsing listings are free, certain advanced features and services may require a premium membership.",
    "blog": "Blog",
    "contact": "Contact",
    "terms": "Terms And Conditions",
    "confidencial": "Confidential Policy",
    "whyUs": "Why pick us ?",
    "whyUsHassleH": "Hassle",
    "whyUsRoommatesH": "Roommates",
    "whyUsHomeListingH": "Home Listing",
    "whyUsSearchH": "Search",
    "whyUsHassle": "Free negotiation   with landlords.",
    "whyUsRoommates": "Find homes half-price by sharing with a roommate.",
    "whyUsHomeListnig": " Lots of options from single rooms to shared places.",
    "whyUsSearch": "Choose where, how much, and what you want.",
    "blogHeader1": "Student Life in Tbilisi",
    "blogText1": "Discover essential tips for thriving as a student in Tbilisi.",
    "blogHeader2": "Student Housing ",
    "blogText2": "Explore student housing in Georgia, with insights into pricing and various accommodation options.",
    "blogHeader3": "Case Studies ",
    "blogText3": "Explore the Stories of Our Clients and Their Roommate Experiences.",
    "blogMainHead": "Start Living Properly",
    "findMore": "Find more",
    "auth": "Authorization"
}
